SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_protimer.h
/* Bit fields for PROTIMER BASECNTTOP */
#define _PROTIMER_BASECNTTOP_RESETVALUE                  0x0000FFFFUL                                   /**< Default value for PROTIMER_BASECNTTOP       */
#define _PROTIMER_BASECNTTOP_MASK                        0x0000FFFFUL                                   /**< Mask for PROTIMER_BASECNTTOP                */
#define _PROTIMER_BASECNTTOP_BASECNTTOP_SHIFT            0                                              /**< Shift value for PROTIMER_BASECNTTOP         */
#define _PROTIMER_BASECNTTOP_BASECNTTOP_MASK             0xFFFFUL                                       /**< Bit mask for PROTIMER_BASECNTTOP            */
#define _PROTIMER_BASECNTTOP_BASECNTTOP_DEFAULT          0x0000FFFFUL                                   /**< Mode DEFAULT for PROTIMER_BASECNTTOP        */
#define PROTIMER_BASECNTTOP_BASECNTTOP_DEFAULT           (_PROTIMER_BASECNTTOP_BASECNTTOP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_BASECNTTOP*/

/* Bit fields for PROTIMER WRAPCNTTOP */
#define _PROTIMER_WRAPCNTTOP_RESETVALUE                  0xFFFFFFFFUL                                   /**< Default value for PROTIMER_WRAPCNTTOP       */
#define _PROTIMER_WRAPCNTTOP_MASK                        0xFFFFFFFFUL                                   /**< Mask for PROTIMER_WRAPCNTTOP                */
#define _PROTIMER_WRAPCNTTOP_WRAPCNTTOP_SHIFT            0                                              /**< Shift value for PROTIMER_WRAPCNTTOP         */
#define _PROTIMER_WRAPCNTTOP_WRAPCNTTOP_MASK             0xFFFFFFFFUL                                   /**< Bit mask for PROTIMER_WRAPCNTTOP            */
#define _PROTIMER_WRAPCNTTOP_WRAPCNTTOP_DEFAULT          0xFFFFFFFFUL                                   /**< Mode DEFAULT for PROTIMER_WRAPCNTTOP        */
#define PROTIMER_WRAPCNTTOP_WRAPCNTTOP_DEFAULT           (_PROTIMER_WRAPCNTTOP_WRAPCNTTOP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_WRAPCNTTOP*/

/* Bit fields for PROTIMER TOUT0CNT */
#define _PROTIMER_TOUT0CNT_RESETVALUE                    0x00000000UL                                /**< Default value for PROTIMER_TOUT0CNT         */
#define _PROTIMER_TOUT0CNT_MASK                          0xFFFFFFFFUL                                /**< Mask for PROTIMER_TOUT0CNT                  */
#define _PROTIMER_TOUT0CNT_TOUT0PCNT_SHIFT               0                                           /**< Shift value for PROTIMER_TOUT0PCNT          */
#define _PROTIMER_TOUT0CNT_TOUT0PCNT_MASK                0xFFFFUL                                    /**< Bit mask for PROTIMER_TOUT0PCNT             */
#define _PROTIMER_TOUT0CNT_TOUT0PCNT_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for PROTIMER_TOUT0CNT          */
#define PROTIMER_TOUT0CNT_TOUT0PCNT_DEFAULT              (_PROTIMER_TOUT0CNT_TOUT0PCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT0CNT  */
#define _PROTIMER_TOUT0CNT_TOUT0CNT_SHIFT                16                                          /**< Shift value for PROTIMER_TOUT0CNT           */
#define _PROTIMER_TOUT0CNT_TOUT0CNT_MASK                 0xFFFF0000UL                                /**< Bit mask for PROTIMER_TOUT0CNT              */
#define _PROTIMER_TOUT0CNT_TOUT0CNT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_TOUT0CNT          */
#define PROTIMER_TOUT0CNT_TOUT0CNT_DEFAULT               (_PROTIMER_TOUT0CNT_TOUT0CNT_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT0CNT  */

/* Bit fields for PROTIMER TOUT0CNTTOP */
#define _PROTIMER_TOUT0CNTTOP_RESETVALUE                 0x00FF00FFUL                                      /**< Default value for PROTIMER_TOUT0CNTTOP      */
#define _PROTIMER_TOUT0CNTTOP_MASK                       0xFFFFFFFFUL                                      /**< Mask for PROTIMER_TOUT0CNTTOP               */
#define _PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_SHIFT         0                                                 /**< Shift value for PROTIMER_TOUT0PCNTTOP       */
#define _PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_MASK          0xFFFFUL                                          /**< Bit mask for PROTIMER_TOUT0PCNTTOP          */
#define _PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_DEFAULT       0x000000FFUL                                      /**< Mode DEFAULT for PROTIMER_TOUT0CNTTOP       */
#define PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_DEFAULT        (_PROTIMER_TOUT0CNTTOP_TOUT0PCNTTOP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT0CNTTOP*/
#define _PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_SHIFT          16                                                /**< Shift value for PROTIMER_TOUT0CNTTOP        */
#define _PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_MASK           0xFFFF0000UL                                      /**< Bit mask for PROTIMER_TOUT0CNTTOP           */
#define _PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_DEFAULT        0x000000FFUL                                      /**< Mode DEFAULT for PROTIMER_TOUT0CNTTOP       */
#define PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_DEFAULT         (_PROTIMER_TOUT0CNTTOP_TOUT0CNTTOP_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT0CNTTOP*/

/* Bit fields for PROTIMER TOUT0COMP */
#define _PROTIMER_TOUT0COMP_RESETVALUE                   0x00000000UL                                     /**< Default value for PROTIMER_TOUT0COMP        */
#define _PROTIMER_TOUT0COMP_MASK                         0xFFFFFFFFUL                                     /**< Mask for PROTIMER_TOUT0COMP                 */
#define _PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_SHIFT          0                                                /**< Shift value for PROTIMER_TOUT0PCNTCOMP      */
#define _PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_MASK           0xFFFFUL                                         /**< Bit mask for PROTIMER_TOUT0PCNTCOMP         */
#define _PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for PROTIMER_TOUT0COMP         */
#define PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_DEFAULT         (_PROTIMER_TOUT0COMP_TOUT0PCNTCOMP_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT0COMP */
#define _PROTIMER_TOUT0COMP_TOUT0CNTCOMP_SHIFT           16                                               /**< Shift value for PROTIMER_TOUT0CNTCOMP       */
#define _PROTIMER_TOUT0COMP_TOUT0CNTCOMP_MASK            0xFFFF0000UL                                     /**< Bit mask for PROTIMER_TOUT0CNTCOMP          */
#define _PROTIMER_TOUT0COMP_TOUT0CNTCOMP_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for PROTIMER_TOUT0COMP         */
#define PROTIMER_TOUT0COMP_TOUT0CNTCOMP_DEFAULT          (_PROTIMER_TOUT0COMP_TOUT0CNTCOMP_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT0COMP */

/* Bit fields for PROTIMER TOUT1CNT */
#define _PROTIMER_TOUT1CNT_RESETVALUE                    0x00000000UL                                /**< Default value for PROTIMER_TOUT1CNT         */
#define _PROTIMER_TOUT1CNT_MASK                          0xFFFFFFFFUL                                /**< Mask for PROTIMER_TOUT1CNT                  */
#define _PROTIMER_TOUT1CNT_TOUT1PCNT_SHIFT               0                                           /**< Shift value for PROTIMER_TOUT1PCNT          */
#define _PROTIMER_TOUT1CNT_TOUT1PCNT_MASK                0xFFFFUL                                    /**< Bit mask for PROTIMER_TOUT1PCNT             */
#define _PROTIMER_TOUT1CNT_TOUT1PCNT_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for PROTIMER_TOUT1CNT          */
#define PROTIMER_TOUT1CNT_TOUT1PCNT_DEFAULT              (_PROTIMER_TOUT1CNT_TOUT1PCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_TOUT1CNT  */
#define _PROTIMER_TOUT1CNT_TOUT1CNT_SHIFT                16                                          /**< Shift value for PROTIMER_TOUT1CNT           */
#define _PROTIMER_TOUT1CNT_TOUT1CNT_MASK                 0xFFFF0000UL                                /**< Bit mask for PROTIMER_TOUT1CNT              */
#define _PROTIMER_TOUT1CNT_TOUT1CNT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_TOUT1CNT          */
#define PROTIMER_TOUT1CNT_TOUT1CNT_DEFAULT               (_PROTIMER_TOUT1CNT_TOUT1CNT_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_TOUT1CNT  */

